-- 書籍情報インサートデータ
insert into books values(1, '明解Java プログラミング入門', '坂田健二','秀和システム', 2980, '4-7980-0437-5', '2012/11/29', '本書は「Javaプログラミングをこれからはじめよう」という人、「Javaプログラミングを始めたけど、どうも理解できない箇所が……」という人向けにイラストを多く取り入れ、内容を視覚的に理解できます。またサンプルプログラムも短いものを数多く掲載しています。本書でJavaの基本を学んでください。', 'c(0).jpg', 10);

insert into books values(2, '図解標準 最新サーブレット&JSPハンドブック', '影山瑛','秀和システム', 2800, '4-7980-0387-5', '2012/09/28', '現在、Webアプリケーションの開発には不可欠の技術として重視されているサーブレット&JSP。基本仕様の解説はむろんのこと、本書では特にサーブレットの多様な可能性を追求します。JavaMailや携帯電話、カスタムタグ、データベースとの連携など、これまで中上級者向けの書籍でしか扱われてこなかったようなテーマを一通り取り上げます。「仕様（文法）は何となくわかったけれど…」といった方でも興味を持ってお読みいただける一冊です。 ', 'c(1).jpg', 10);

insert into books values(3, 'Javaプログラミングを始めよう！', '村山要司','秀和システム', 2200, '4-7980-0406-5', '2012/09/27', '本書はパソコンスクールで講座を受けているような感覚で、Javaのプログラミングを修得できます。パソコンスクールの授業の進め方同様、まずは作ってみる。そしてあとから理屈を覚えていく。サンプルプログラムを作成していくことで、プログラミングがどんどん楽しくなります。各過程に補修問題や練習問題を多数掲載し、ステップ毎に実力が付いていることを実感することもできます。 ', 'c(2).jpg', 10);

insert into books values(4, '図解入門 よくわかる最新サーバサイドJavaの基本と仕組み', 'デュオシステムズ','秀和システム', 1900, '4-7980-0356-5', '2012/08/20', 'いまやコンピュータ言語の枠を越え、インターネットの標準テクノロジーとしての地位を占める「Java」。Webの発展に不可欠のものとして、その重要性がますます高まっています。本書は、このJavaテクノロジーの最前線に迫ります。サーバサイドで展開するサーブレット、JSPといった技術はむろんのこと、J2EEとEJBコンポーネント、そして、JXTAやSun ONEといった最新の話題まで、あますところなくJavaテクノロジーの大いなる可能性と未来を展望します。 ', 'c(3).jpg', 10);

insert into books values(5, '標準Java Webデータベースプログラミング', '横井与次郎','秀和システム', 3800, '4-7980-0386-7', '2012/09/11', '本書はデータベースを用いたサーバサイドアプリケーションのプログラミング方法を解説した書籍です。解説対象はJava(JSP、サーブレット、JDBC)、SQL(MySQL)です。 実際に簡単なデータベースとWebアプリケーションをつくり、実例を元に解説しているので、どのような原理で動作するのかわかりやすく学ぶ事が出来ます。', 'c(4).jpg', 10);

insert into books values(6, 'Java & Cocoa プログラミングバイブル', '掌田津耶乃','秀和システム', 3800, '4-7980-0353-0', '2012/06/29', 'Mac OS Xは、現在リリースされているすべてのOSのなかで唯一「Java2」をシステムレベルで標準搭載しているOSです。本書は、この最新のJava環境を使い、掌田津耶乃氏による軽快でわかりやすい解説によって、pure JavaとCocoa-Javaの両方の基礎を無理なく学ぶことができます。Java入門からMac OS Xのプログラミングまで、すべてまかなうおすすめの1冊です。', 'c(5).jpg', 10);

insert into books values(7, 'TECHNICAL MASTER はじめてのJSP&サーブレットプログラミング Tomcat4+MySQL3対応', 'ラクス','秀和システム', 2400, '4-7980-0312-3', '2012/05/31', '本書は、テクニカルなテーマを入門者の方々にわかりやすくレクチャーする“TECHNICAL MASTER”シリーズのJSPプログラミング入門編です。JSPは、サーバサイドJavaのプログラミングを手軽に行える技術として注目されています。本書は、このJSPを初心者の方にわかりやすくレクチャー。サーバサイドJavaの基本から、JSP、サーブレットの基礎、簡単なWebアプリケーションの構築と管理まで学べます。付属のCD-ROMには、Windows/Linux上ですぐに学習環境が構築できるようにフリーの開発ツールを収録しています。', 'c(6).jpg', 10);

insert into books values(8, 'サーブレット&JSP 実践プログラミングテクニック', 'ラクス','秀和システム', 3200, '4-7980-0294-1', '2012/04/26', '本書は、サーブレット、JSP、JavaBeansのプログラムテクニックを集めた書籍です。プログラムの内容は、それぞれの基本構文から始まり、HTMLタグ出力の基本、内部のリンクURL中のパス、エレメントのコード、ユーザリクエストの送受などをポイント別に紹介しています。それぞれOSに依存しないコードを載せる事で様々な環境で使えるサンプルとなっています。 ', 'c(7).jpg', 10);

insert into books values(9, 'TECHNICAL MASTER はじめてのJavaプログラミング JavaTM2 SDK対応', '佐藤滋','秀和システム', 2200, '4-7980-0286-0', '2012/03/28', 'Javaを勉強してみたいがどこから手を付けたら良いかわからない、という人向けの書籍です。「ともかく何か作って、動かして学ぶ」をコンセプトに説明を進めています。Javaの文法を一通り理解したあとは「簡単なJavaプログラムが作れる」「Javaの「クラス」とは何かということが理解できる」「Javaのさらに難しい知識を理解するための基礎を覚える」というレベルを目指します。CDには開発環境(JDK)とソースが収録されています。', 'c(8).jpg', 10);

insert into books values(10, 'Java逆引き大全 500の極意', '高橋和也、井川はるき、さとうひでき、プロジェクトA','秀和システム', 2400, '4-7980-0256-9', '2012/03/01', 'いま知りたい、いま使いたいJavaプログラミングが満載！AWT、Swing、ネットワーク、データベース、さらにはJSPやiモードプログラミングなど、サンプルプログラムなどとともに解説するテクニック数は合計500項にも及びます。基礎中の基礎から業務に使える高度なプログラミングテクニックまでを集めた待望の一冊です。 ', 'c(9).jpg', 10);

insert into books values(11, '標準JAVA&XMLサーバサイドプログラミング', '横井与次郎 ','秀和システム', 4200, '4-7980-0225-9', '2011/12/14', '本書は、サーバサイドでのJavaによるファイル操作（ファイルI/Oなど）プログラミングの解説書です。操作対象ファイルのベースは、XML文書、一般的なテキストファイルやZipファイルなどです。それぞれの解説は、実際にアプリケーションを構築して具体的にソース、プログラムを示し、解説していきます。それぞれのソースは全てCDに収録してあります（JDK1.4ベータ版に対応したソースも別途CDに収録）。', 'c(10).jpg', 10);

insert into books values(12, '図解標準 最新Javaハンドブック', '（株）オフィスエム ','秀和システム', 2800, '4-7980-0215-1', '2011/11/30', 'Javaはホームページで利用されるばかりでなく、iモ－ド対応携帯電話や情報家電など、より身近な機器にも使用され需要が増しています。本書は、最新版の開発ツールである「Java2（JDK1.3）」に完全対応し、はじめてプログラミングをする読者にも理解できるよう、豊富な図版を用いて基本から解説します。付録CD-ROMには、JDKの最新版だけでなく、各種APIや統合開発環境ソフトウェアForte 3.0を収録しています。', 'c(11).jpg', 10);

insert into books values(13, '標準JAVAサーブレット & JSPプログラミング', '横井与次郎','秀和システム', 4200, '4-7980-0172-4', '2011/09/07', '本書は「標準JAVAプログラミング」の上級、応用編で、サーブレットとJSPを使ったサーバーサイドでのプログラミングを解説しています。たとえばネットワークがからむことで、今までのクライアントサイドのプログラミングではなかった制約など、本書はネットワークプログラミングにおいて必要となる基本的な知識、用語の説明から始め、ネットワークアプリケーションを作るまでを詳細に解説しています。実際に動くアプリケーションを作ることで、効果的にネットワークプログラミングを学ぶことができます。CD-ROM付き。', 'c(12).jpg', 10);

insert into books values(14, 'XML&JavaScriptシステム開発', '高羽実','秀和システム', 3200, '4-7980-0131-7', '2011/06/23', 'JAVAScriptによるXML文書操作の入門書です。Windows上でJAVAScriptを使って、XMLを操作するにはどうすればいいのかを、DOMやXLMSを交えて、基本概念から分かりやすく説明しています。また、それぞれの目的に応じXML文書を用意しているので、実践的な内容となっています。本書で解説したプログラムは付属CD-ROMに収録しているのでサンプル集としても利用できます。プログラミング経験者向け。 ', 'c(13).jpg', 10);

insert into books values(15, '標準XML&JAVAプログラミング', '横井与次郎','秀和システム', 2980, '4-7980-0111-2', '2011/04/28', 'JAVAによるXML文書操作の入門書です。Windows上でJAVA2 SDKとJAXP1.1を使って、XMLをJAVAのプログラムで操作するにはどうすればいいのかを、基本概念から分かりやすく説明しています。また、それぞれの目的に応じXML文書を用意しているので、実践的な内容となっています。本書で解説したプログラムは付属CD-ROMに収録しているのでサンプル集としても利用できます。プログラミング経験者向け。CD-ROM付き。', 'c(14).jpg', 10);

insert into books values(16, 'XML/DOM Programming', '浅海智晴','秀和システム', 5200, '4-7980-0107-4', '2011/04/21', 'インターネット時代のドキュメントフォーマットとして注目されているXML。これからはXMLを使ったプログラム開発が新たな潮流となります。XMLと相性の良いJavaによる開発技法は、多くの読者が待ち望んでいる解説書です。著者はSmartDocやRelaxerなど、著名なXML&Javaアプリケーションの開発者であり、専門誌への寄稿も数多く行っている、XML&Javaの第一人者です。JAXP 1.1(SAX2,DOM2,XSLT)完全対応。CD-ROM一枚付き。', 'c(15).jpg', 10);

insert into books values(17, 'JavaMail 完全解説', '木下信','秀和システム', 2850, '4-7980-0089-2', '2011/03/01', 'E-ビジネス・サイトはJavaで構築するのが現在の標準です。ショッピングサイトやWebオークションなどで欠かせないものがEメールを使った顧客管理。というわけで、Javaを使ったメール・プログラミングの需要は拡大しています。本書はJavaMailの導入からビジネス・サイト構築までの過程を完全解説しています。 ', 'c(16).jpg', 10);

insert into books values(18, '標準 JAVAプログラミング', '横井与次郎','秀和システム', 3200, '4-7980-0062-0', '2010/12/01', 'JAVAアプリケーションのプログラミングに関して解説した書籍です。実際にJAVAでプログラミングをする上で必要になってくる情報を集めました。サンプルも全て実際に使えるように考慮されたものを選んで掲載、解説をしています。また、ポイント別に項目を分けていますので、必要な情報にすぐアクセスできます。プログラマのためのJAVAプログラミング解説書籍の決定版です。CD-ROM付。', 'c(17).jpg', 10);

insert into books values(19, 'JBuilderではじめるJavaプログラミング入門', '掌田津耶乃','秀和システム', 3200, '4-7980-0067-1', '2010/12/01', '本書は、インプライズ社より新しくリリースされたJBuilder Foundation版による初めてのJava言語入門書です。最新の開発環境と、掌田津耶乃氏による軽快でわかりやすい解説によって、Java言語の基本仕様からアプリケーション作成までを無理なく学ぶことができます。CD-ROM付。', 'c(18).jpg', 10);

insert into books values(20, 'Javaではじめるプログラミング オブジェクト指向プログラミング入門', '箕原辰夫','秀和システム', 3200, '4-7980-0074-4', '2010/12/01', 'Javaは、今やネットワーク・プログラミングのための主要な言語としてその地位を確立した感があります。本書はこのJavaについて、プログラミングの基礎から段階的に学ぶことのできる入門書です。Javaを使いこなすにはオブジェクト指向アプローチが欠かせませんが、本書は解説の随所随所において、オブジェクト指向プログラミングを実践するための説明を行っていますので、オブジェクト指向プログラミングの入門書としても活用することができるでしょう。Java2対応です。', 'c(19).jpg', 10);

insert into books values(21, 'ホンキで学ぼう！ Javaのキホン', '有賀妙子','秀和システム', 2500, '4-7980-0023-X', '2010/08/01', '「Javaってなんだか難しそう…」Javaに入門しようとする人は、少なからずこう思うようです。実際、「何を」「どこから」始めればいいかをきちんと解説した書籍は少なく、Javaに挫折した人も多いのです。でも、本書があれば心配はいりません。実際に学校で講師として教壇に立つ著者は、Javaを始める人にとって、何が大変か、そして、どう解説すればいちばん理解しやすいかを知っています。この本で手軽に楽しく、そして本格的にJavaを学んでみませんか？', 'c(20).jpg', 10);

insert into books values(22, 'Java Super Tips オブジェクト指向設計編', '浅海智晴','秀和システム', 3200, '4-7980-0012-4', '2010/07/01', 'Java系雑誌で大活躍中の著者が精魂込めて書き上げたJavaプログラミング解説書の決定版です。豊富なサンプルを使って「オブジェクト指向」を探求していく内容で、中上級者向けの実践的な内容です。姉妹巻「オブジェクト指向実装編」（次回刊行予定）とあわせてお読み下さい。オブジェクト指向設計・一歩進んだHelloWorld・プログラミング基本技術・最適化（オプティマイズ）・クラス設計・テキスト処理など。', 'c(21).jpg', 10);

insert into books values(23, 'Microsoft Visual J++6.0 WFCプログラミング', '小橋一','秀和システム', 2600, '4-87966-827-3', '2009/02/01', 'Microsoft Visual J++6.0で新しくサポートされた「WFCライブラリ」を使い、高速なJavaアプリケーションを開発するための解説書です。統合開発環境のVisual Studio6.0や、Javaの言語仕様についても触れていますので、Java言語が初めての方にもおすすめです。 ', 'c(22).jpg', 10);

insert into books values(24, 'Java Servlet 最新サーバ・プログラミング', '原田洋子','秀和システム', 4200, '4-87966-870-2', '2009/02/01', 'JavaServletは、従来のCGIよりも優れた性能を持った最新ネットワーク・プログラミングです。本書はServletの導入から高度な3層モデル環境の構築までを網羅。全ソース・コードをCD-ROMに収録します。CD-ROM1枚付き。', 'c(23).jpg', 10);

insert into books values(25, 'TECHNICAL MASTER はじめてのSolaris8 サーバ構築編', '井上亜潮','秀和システム', 2400, '4-7980-0409-X', '2012/11/22', 'フリーSolarisによって敷居の低いものになったSolaris8の入門書です。本書を読んで、ひととおりのサーバの環境・セッティング・各種サービスの設定などができるようになります。ウェブ（Apache）、メール（Sendmail）、プリンタ（lpd）、ファイル共有（Samba、Netatalk）、DNSサーバ（BIND）など、よく使われるものから丁寧に解説しています。', 'd(0).jpg', 10);

insert into books values(26, 'Red Hat Linux 7.3入門キット', '吉村圭太郎、沓名亮典、安藤葉子','秀和システム', 2200, '4-7980-0373-5', '2012/08/21', '本書は、人気の高いディストリビューションであるRed Hat Linuxの最新版7.3の入門書です。機能と使い勝手を大幅に向上させたRed Hat Linuxをわかりやすく解説しています。添付されている3枚のCD-ROMを使えば、誰でも簡単にLinuxの世界を体験できます。 ', 'd(1).jpg', 10);

insert into books values(27, 'TECHNICAL MASTER はじめてのRed Hat Linux 7.3 サーバ構築編', 'ラクス','秀和システム', 2500, '4-7980-0362-X', '2012/07/27', '本書は、テクニカルなテーマを入門者の方々にわかりやすくレクチャーする“Technical Master”シリーズのサーバ構築編です。本書ではRed Hat Linuxによるサーバ構築について、ガイダンス、インストールからさまざまなサービスを実現するための設定方法を、ワンステップずつ詳細に解説。文字どおり、“はじめての”人に向けた技術ハウツー入門書籍です。Red Hat Linuxの最新版7.3のFTP版を収録したCD-ROM（3枚）付きです。設定ファイルやユーティリティは著者のサイトよりダウンロードできます。', 'd(2).jpg', 10);

insert into books values(28, 'ノートブックパソコンではじめるLinux', '山田政敏','秀和システム', 2400, '4-7980-0363-8', '2012/07/26', 'Windows上にLinuxをインストールして、Linuxを簡単に使ってみよう！　さわって、使って、慣れよう！　「習うより慣れろ」がキーコンセプト。インストールの難しいノートパソコンへのインストールや設定の仕方をわかりやすく、しかも詳細に解説。Linuxが必要なくなったり、設定がうまくいかない場合にはWindowsのゴミ箱へ簡単に削除可能です。もちろんLinuxの専用領域を使ってのインストール・利用方法も解説。Linux初心者はもちろん、Linux再入門者にも気軽にWindows上にLinuxをインストール、利用ができます！', 'd(3).jpg', 10);

insert into books values(29, 'Red Hat Linux7.3ではじめるWebサーバー', '長谷川光、塩見豊久、おかべたかし','秀和システム', 1600, '4-7980-0340-9', '2012/07/10', '本書は、LINUXにちょっと乗り遅れてしまったかもしれないというユーザーを対象に、LINUXをインストールして、自分でWebサーバーを作るところまでを、手順を追って懇切ていねいに解説する入門書です。ちょっと高いレベルのテーマですが、いまからはじめようかと思っている入門者にうってつけです。 ', 'd(4).jpg', 10);

insert into books values(30, 'Vine Linux 2.5 入門キット', '林雅人','秀和システム', 2400, '4-7980-0311-5', '2012/05/31', 'Linux入門の定番のVine Linux入門キットが、新バージョンになりました。本書は、初めてLinuxを入れる人のために、インストールから、Linuxの基礎知識、ちょっとしたアプリの使い方までを解説する「入門キット」です。現在ブロードバンドが驚くような勢いで広まっています。Linuxでもブロードバンド接続をしたい、ADSLで接続は？ ケーブルTVは？ FTTHは？ルータは？そんな疑問も、Linux CD付きの本書1冊で、インストールから使えるようになるまですべてOKです。', 'd(5).jpg', 10);

insert into books values(31, 'TECHNICAL MASTER はじめてのRed Hat Linux 7.2 サーバ構築編', 'アイティブースト','秀和システム', 2100, '4-7980-0264-X', '2012/02/23', '本書は、テクニカルなテーマを入門者の方々にわかりやすくレクチャーする“Technical Master”シリーズのサーバ構築編です。本書ではRed Hat Linuxによるサーバ構築について、ガイダンス、インストールからさまざまなサービスを実現するための設定方法を、ワンステップずつ詳細に解説。文字どおり、“はじめての”人に向けた技術ハウツー入門書籍です。Red Hat Linuxの最新版7.2のFTP本書専用サブセット版と、本文中のサンプルファイルなどを収録した親切なCD-ROM付きです。', 'd(6).jpg', 10);

insert into books values(32, 'TECHNICAL MASTER はじめてのTurbolinux 7 サーバ構築編', 'アイティブースト','秀和システム', 2100, '4-7980-0265-8', '2012/02/23', '本書は、テクニカルなテーマを入門者の方々にわかりやすくレクチャーする“Technical Master”シリーズのサーバ構築編です。本書ではTurbolinuxによるサーバ構築について、ガイダンス、インストールからさまざまなサービスを実現するための設定方法を、ワンステップずつ詳細に解説。文字どおり、“はじめての”人に向けた技術ハウツー入門書籍です。TurboLinux serverの最新版7の本書専用サブセット版と、本文中のサンプルファイル、ユーティリティなどを収録した親切なCD-ROM付きです。 ', 'd(7).jpg', 10);

insert into books values(33, 'Red Hat Linux 7.2 入門キット', '吉村圭太郎、沓名亮典、安藤葉子','秀和システム', 1980, '4-7980-0253-4', '2012/02/09', '本書は、人気の高いディストリビューションであるRed Hat Linuxの最新版7.2の入門書です。機能と使い勝手を大幅に向上させたRed Hat Linuxをわかりやすく解説しています。添付されている2枚のCD-ROMを使えば、誰でも簡単にLinuxの世界を体験できます。', 'd(8).jpg', 10);

insert into books values(34, 'とってもかんたんTurbolinux7', '一条真人','秀和システム', 2200, '4-7980-0202-X', '2012/10/27', '好評だった前作「とってもかんたんTurbolinux6」のバージョンアップ版です。今回のコンセプトは「Windowsユーザーが、とりあえずインストールして、とりあえず使える解説書」をめざしています。初心者の方でも取り組みやすいように2色刷りで、イラストを多用したわかりやすい解説書です。', 'd(9).jpg', 10);

insert into books values(35, 'Red Hat Linux 7 入門キット', '林雅人','秀和システム', 2600, '4-7980-0068-X', '2010/12/01', '本書はLinuxの標準OS、Red Hat Linux7の入門書です。ボリュームアップしたRed Hat Linuxを付属のCD-ROMからインストールする方法から、一通りの機能を使いこなすまでを丁寧に解説しています。 ', 'd(10).jpg', 10);

insert into books values(36, 'いまからはじめるSolaris8 基本コマンド＆操作編', '小川尚子','秀和システム', 1800, '4-7980-0030-2', '2010/09/01', '本書は、最新UNIXオペレーティングシステム「Solaris 8」の入門・初級者向け、基本操作解説書です。デスクトップ操作からミニマムシステム管理まで、日常の運用に必要な基本とチップスをコンパクトな内容にまとめました。Solarisの実習テキストとして、いまからSolarisを始めてみたい方に最適です。 ', 'd(11).jpg', 10);

insert into books values(37, 'Vine Linux 2 入門キット', '林雅人','秀和システム', 2400, '4-7980-0004-3', '2010/06/01', '究極の日本語Linuxとして支持されているVine Linux2の入門キットの決定版。インストールの方法から、ウインドウの使い方、アプリケーションの使い方と、親切に解説しているので、Linuxが初めての方にもおすすめです。Linuxをはじめてみようという方は、ぜひ本書で完成度の高いVine Linuxを体験してみてください。', 'd(12).jpg', 10);

insert into books values(38, 'とってもかんたん TurboLinux6', '一条真人','秀和システム', 2400, '4-87966-998-9', '2010/06/01', '最新のTurboLinux6.0のインストールと設定マニュアルとしてボリュームたっぷりの一冊です！　デスクトップはもとよりノートパソコンの設定と利用方法をPCMCIAカードやインターネットの利用法などと一緒に丁寧にわかりやすく解説しています。CD-ROM１枚付き。 ', 'd(13).jpg', 10);

insert into books values(39, 'LinuxPPC R5 日本語版入門キット', '臼田昭司','秀和システム', 2800, '4-87966-975-X', '2010/02/01', 'Power Macintosh対応のLinuxディストリビューションであるLinuxPPC R5(1999 Q3)と，その日本語化パッケージ「陽炎」を含めた入門キット。従来のMacintoshユーザーやWindowsユーザーのためにインストールを2パターンに分けて特に重点的に解説。最新デスクトップ環境であるGNOME+EnlightenmentやKDEも、豊富な実例で解説。GNOMEアプリケーション、Netscape Communicator、UNIXコマンドの使い方にもページを大きく割いて紹介。CD-ROM 2枚付き。 ', 'd(14).jpg', 10);

insert into books values(40, 'CG検定・画像処理検定 対策シリーズ1 画像情報処理入門', '赤間世紀','秀和システム', 2000, '4-7980-0403-0', '2012/09/27', 'コンピューターを使った画像処理にはハードウェア及びソフトウェアの知識が必要不可欠です。本書は、なるべく画像処理に必要な数学に関する議論は避けて、画像処理の全体像を説明しています。マルチメディア時代に対応した新しい画像処理の教科書としてお読みください。 ', 'e(0).jpg', 10);

insert into books values(41, 'ズバリ的中！ SPI完全攻略問題集', '人材育成技術研究所、石川正樹','秀和システム', 1200, '4-7980-0388-3', '2012/09/25', '「大企業に就職すれば安心」という時代はもう過ぎ去りました。本書は入社試験最初の関門であるSPIテストの突破を目的とした試験対策本です。自信がつくまで繰り返し繰り返し問題を解いて自信をつけ、意中の会社に就職しましょう。 ', 'e(1).jpg', 10);

insert into books values(42, 'ネットワーク[午後]試験対策問題集', 'NWSE研究会 ','秀和システム', 2800, '4-7980-0375-1', '2012/08/23', '情報処理試験のスーパーブックシリーズのテクニカルエンジニア（ネットワーク）試験午後版です。短時間で午後問題における記述式問題の解法スキルをアップできるよう、短答式のオリジナル問題で構成されています。解答欄に直接書き込みができるので学習効率が上がります。', 'e(2).jpg', 10);

insert into books values(43, 'Ａｃｃｅｓｓ2002 MOT Essentials重点対策&スキルアップマニュアル', 'E-Trainer.jp','秀和システム', 2400, '4-7980-0436-7', '2012/11/26', '2002年3月より、超人気資格であるMOT（Microsoft Official Trainer）の試験制度が、大幅に変更されました。その中でも、最も大きな変更点であるのが、新筆記試験「Essentials」。本書は、Access2002版Essentialsの傾向と対策について、現役MOTチームが余すことなく解説しています。MOT資格を新たに取得する人、既に取得済みの資格を更新する人にとって、必須のバイブルになることでしょう。 ', 'e(3).jpg', 10);

insert into books values(44, 'PowerPoint2002 MOT Essentials 重点対策＆スキルアップマニュアル', 'E-Trainer.jp','秀和システム', 2200, '4-7980-0429-4', '2012/11/02', '2002年3月より、超人気資格であるMOT（Microsoft Official Trainer）の試験制度が、大幅に変更されました。その中でも、最も大きな変更点であるのが、新筆記試験「Essentials」。本書は、PowerPoint2002版Essentialsの傾向と対策について、現役MOTチームが余すことなく解説しています。MOT資格を新たに取得する人、既に取得済みの資格を更新する人にとって、必須のバイブルになることでしょう。', 'e(4).jpg', 10);

insert into books values(45, 'Excel2002 MOT Essentials 重点対策&スキルアップマニュアル', 'E-Trainer.jp','秀和システム', 2200, '4-7980-0358-1', '2012/07/31', '2002年3月より、超人気資格であるMOT（Microsoft Official Trainer）の試験制度が、大幅に変更されました。その中でも、最も大きな変更点であるのが、新筆記試験「Essentials」。本書は、Excel2002版Essentialsの傾向と対策について、現役MOTチームが余すことなく解説しています。MOT資格を新たに取得する人、既に取得済みの資格を更新する人にとって、必須のバイブルになることでしょう。 ', 'e(5).jpg', 10);

insert into books values(46, 'MOUS上級試験 Word2002対策テキスト&模擬問題集', '荒木早苗','秀和システム', 2200, '4-7980-0348-4', '2012/07/27', '本書は試験範囲であるスキルとタスクを100％完全網羅した、MOUS試験Word2002のマイクロソフト公認コースウェアです。本試験同様のサンプルを次々と解いていく勉強法なので、みるみるうちに実力が付いてきます。また、添付CD-ROMには、本試験さながらの模擬試験体験プログラムを6パターン収録しています。もちろん、すべて自動採点/成績分析機能付き。MOUS試験対策は、本書があれば完璧です。 ', 'e(6).jpg', 10);

insert into books values(47, 'MOUS上級試験 Excel2002対策テキスト&模擬問題集', 'E-Trainer.jp','秀和システム', 2200, '4-7980-0349-2', '2012/07/27', '本書は試験範囲であるスキルとタスクを100％完全網羅した、MOUS試験Excel2002のマイクロソフト公認コースウェアです。本試験同様のサンプルを次々と解いていく勉強法なので、みるみるうちに実力が付いてきます。また、添付CD-ROMには、本試験さながらの模擬試験体験プログラムを6パターン収録しています。もちろん、すべて自動採点/成績分析機能付き。MOUS試験対策は、本書があれば完璧です。 ', 'e(7).jpg', 10);

insert into books values(48, 'MOUS一般試験 Access2002対策テキスト&模擬問題集', '五十嵐紀江','秀和システム', 2200, '4-7980-0350-6', '2012/07/27', '本書は試験範囲であるスキルとタスクを100％完全網羅した、MOUS試験Access2002のマイクロソフト公認コースウェアです。本試験同様のサンプルを次々と解いていく勉強法なので、みるみるうちに実力が付いてきます。また、添付CD-ROMには、本試験さながらの模擬試験体験プログラムを6パターン収録しています。もちろん、すべて自動採点/成績分析機能付き。MOUS試験対策は、本書があれば完璧です。 ', 'e(8).jpg', 10);

insert into books values(49, 'MOUS総合試験 PowerPoint2002対策テキスト&模擬問題集', 'E-Trainer.jp','秀和システム', 2200, '4-7980-0351-4', '2012/07/27', '本書は試験範囲であるスキルとタスクを100％完全網羅した、MOUS試験PowerPoint2002のマイクロソフト公認コースウェアです。本試験同様のサンプルを次々と解いていく勉強法なので、みるみるうちに実力が付いてきます。また、添付CD-ROMには、本試験さながらの模擬試験体験プログラムを6パターン収録しています。もちろん、すべて自動採点/成績分析機能付き。MOUS試験対策は、本書があれば完璧です。', 'e(9).jpg', 10);

insert into books values(50, '初級シスアド必修合格用語 引いて、読んで、解く辞典', 'メディアMAI','秀和システム', 1400, '4-7980-0354-9', '2012/07/27', '試験の直前対策として効果的な穴埋め式の基本必須用語問題集です。過去10回の初級シスアド試験問題800問のうち、用語の理解を問う問題はなんと8割強。しかも400語程度の用語が基本となっています。本書は、必須用語800のほかに関連重要語句400をあわせて解説。用語事典としても使え、赤の透過シートをページの上に載せれば直前対策のアナ埋め問題に早変わりします。 ', 'e(10).jpg', 10);

insert into books values(51, 'Word2002 MOT Essentials 重点対策&スキルアップマニュアル', 'E-Trainer.jp','秀和システム', 2200, '4-7980-0357-3', '2012/07/25', '2002年3月より、超人気資格であるMOT（Microsoft Official Trainer）の試験制度が、大幅に変更されました。その中でも、最も大きな変更点であるのが、新筆記試験「Essential」。本書は、Word2002版Essentialの傾向と対策について、現役MOTチームが余すことなく解説しています。MOT資格を新たに取得する人、既に取得済みの資格を更新する人にとって、必須のバイブルになることでしょう。 ', 'e(11).jpg', 10);

insert into books values(52, 'オラクルマスター Silver 標準教科書 Oracle9i試験対応', '田中利幸、新名純子','秀和システム', 2400, '4-7980-0342-5', '2012/07/18', '日本オラクル株式会社が主催する、人気のデータベース技術者資格試験・オラクルマスター。本書は、入門者レベルのSilver取得のための学習書で、試験科目の「SQL（1Q0-005J）」と「Oracle入門（1Q0-006J）」の2つを分かりやすく解説した一冊です。', 'e(12).jpg', 10);

insert into books values(53, 'オラクルマスター Silver 標準問題集 Oracle9i試験対応', '田中利幸、新名純子','秀和システム', 2200, '4-7980-0343-3 ', '2012/07/18', '日本オラクル株式会社が主催する、人気のデータベース技術者資格試験・オラクルマスター。本書は、入門者レベルであるSilverの試験科目「SQL（1Q0-005J）」「Oracle入門（1Q0-006J）」に関する例題を220問収録し、試験直前の要点の最終確認に役立つ問題集となっています。 ', 'e(13).jpg', 10);

insert into books values(54, '.com Master★2002 予想問題集', '松栄宏明','秀和システム', 2200, '4-7980-0332-8 ', '2012/06/15', '毎回2万人以上の受検者を集めるインターネット検定「.com Master」の、7月に行われる第3回検定試験、★（シングルスター）レベル対策の問題集です。問題と解説で要点を確実に押さえ、添付の赤フィルターを利用して学習がより平滑に行えるほか、試験直前の再確認用として、チェックボックス付き用語/要点一覧を収録しています。また、12月予定の第4回試験も視野に入れた内容になっています。チェック用の赤フィルターも付属。', 'e(14).jpg', 10);

insert into books values(55, 'ROM付 基本情報技術者 午前 スーパー合格本', '三輪幸市','秀和システム', 1800, '4-7980-0240-2', '2012/01/19', '『スーパー合格本』の基本情報技術者午前試験対策本です。重要項目に絞って詳しく解説しています。フルカラーでさらに見やすくなりました。左ページの「ポイント攻略」　　は図や表を中心に、右ページでは「ワンポイント」「関連項目」で得点力アップを狙います。さらに見出し項目を出題頻度や出題傾向別に分類しているので、重点的な学習が可能です。初めての受験者も安心の参考書。付録のCD-ROMには、過去3年間の本試験問題(午前問題)を収録。 ', 'e(15).jpg', 10);

insert into books values(56, 'ROM付 基本情報技術者 午後 スーパー合格本', '三輪幸市','秀和システム', 1800, '4-7980-0241-0', '2012/01/19', '『スーパー合格本』の基本情報技術者午後試験対策本です。【ポイント攻略】で試験に出る重要項目を絞込み、図式化しました。【チャレンジ例題】では、過去に出題された問題を精選し、その解き方をズバリ解説。言語はC言語とCOBOLに対応し、より高得点を得るためのテクニックも満載しています。受験生が安心して試験対策に取り組める基本情報技術者試験、みんなが納得する参考書。付録のCD-ROMには、過去3年間の本試験問題(午後問題)を収録。 ', 'e(16).jpg', 10);

insert into books values(57, 'ジャンル別重要語句から理解する 初級シスアド過去問800', 'メディアMAI','秀和システム', 1600, '4-7980-0235-6', '2011/12/27', '2001年春の情報処理技術者試験の改訂は、情報化推進の社会情勢を背景に、スキルの高い人材の育成と発掘を目指したものです。本書は、受験者の要望に応え、シスアド試験対策に必要な項目をジャンル別に編集。過去10回分のシスアド試験800問を、重要語句の解説を通して収録、紹介しました。関連用語の理解はシスアド試験対策の第一歩です。そして、これまでの3割は過去問との同一問題です。また、5割強は過去問との同一パターンです。シスアド試験直前対策としても十分に役立つことでしょう。', 'e(17).jpg', 10);

insert into books values(58, 'ROM付 初級シスアド スーパー合格本', '三輪幸市','秀和システム', 1800, '4-7980-0226-7', '2011/12/13', 'ご好評いただいた『スーパー合格本』のシスアド試験対策本。試験に出る重要項目を絞り込み、図式化して詳しく解説しています。「頻出ポイント」「重要語句」といった受験生に必要な情報を満載。安心して試験対策に取り組める初級シスアド試験、みんなが納得する参考書です。付録のCD-ROMには過去3年間の本試験問題を収録してあります。', 'e(18).jpg', 10);

insert into books values(59, 'ROM付 初級シスアド 過去問スーパー攻略', '木村宏一','秀和システム', 1600, ' 4-7980-0227-5', '2011/12/13', '過去に出題された試験問題からよく出る問題を精選し、ポイントを絞って解き方をやさしく解説。豊富な例題と充実した解説で、参考書としても使える新しいタイプの初級シスアド問題集です。付録のCD-ROMには過去5年間の本試験問題を収録してあります。', 'e(19).jpg', 10);
